controllers/SiteController.php

    public function actionIndex() {

      if($_POST){
         $query = User::find()->where(['username' => Yii::$app->request->post()['LoginForm']['username']])->one();
---
SELECT * FROM `user` WHERE `username`='admin'