controllers/TestController.php

    public function actionImportcsv()
    {
        $model = new Test();
        $user  = ArrayHelper::map(User::find()->all(), 'id', 'username');
---
SELECT * FROM `user`