models/UserProfile.php

SELECT * FROM `user_profile` WHERE `user_id` IS NULL
---
    public static function findProfileByUserId($user_id) {

        return static::findOne(['user_id' =>$user_id]);